fio-test/results/raizn_seq_write/16k-psync-4.out
job1: (g=0): rw=write, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=39813: Wed Sep  4 20:13:43 2024
  write: IOPS=32.8k, BW=512MiB/s (537MB/s)(673GiB/1346282msec); 0 zone resets
    clat (usec): min=50, max=2967, avg=237.52, stdev=75.15
     lat (usec): min=50, max=2969, avg=237.98, stdev=75.34
    clat percentiles (usec):
     |  1.00th=[  116],  5.00th=[  143], 10.00th=[  157], 20.00th=[  167],
     | 30.00th=[  184], 40.00th=[  217], 50.00th=[  243], 60.00th=[  253],
     | 70.00th=[  262], 80.00th=[  285], 90.00th=[  326], 95.00th=[  359],
     | 99.00th=[  529], 99.50th=[  578], 99.90th=[  644], 99.95th=[  668],
     | 99.99th=[  775]
   bw (  KiB/s): min=361799, max=844576, per=100.00%, avg=533116.24, stdev=12571.34, samples=21206
   iops        : min=22610, max=52784, avg=33317.30, stdev=785.70, samples=21206
  lat (usec)   : 100=0.23%, 250=56.89%, 500=41.71%, 750=1.16%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=2.67%, sys=6.27%, ctx=44114274, majf=0, minf=196
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,44113920,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=512MiB/s (537MB/s), 512MiB/s-512MiB/s (537MB/s-537MB/s), io=673GiB (723GB), run=1346282-1346282msec

Disk stats (read/write):
    dm-0: ios=48/44113383, merge=0/0, ticks=0/9683512, in_queue=9683512, util=100.00%, aggrios=22/17646836, aggrmerge=0/0, aggrticks=1/539215, aggrin_queue=539217, aggrutil=100.00%
  nvme1n2: ios=26/17646850, merge=0/0, ticks=1/537552, in_queue=537552, util=100.00%
  nvme4n2: ios=12/17646830, merge=0/0, ticks=1/538702, in_queue=538703, util=100.00%
  nvme0n2: ios=36/17646832, merge=0/0, ticks=2/536593, in_queue=536596, util=100.00%
  nvme3n2: ios=18/17646826, merge=0/0, ticks=1/541690, in_queue=541692, util=100.00%
  nvme2n2: ios=20/17646843, merge=0/0, ticks=2/541542, in_queue=541543, util=100.00%