fio-test/results/raizn_seq_write/256k-psync-8.out
job1: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=118904: Thu Sep  5 10:19:57 2024
  write: IOPS=12.6k, BW=3146MiB/s (3298MB/s)(673GiB/219123msec); 0 zone resets
    clat (usec): min=118, max=2877, avg=613.59, stdev=116.73
     lat (usec): min=126, max=2891, avg=629.71, stdev=117.87
    clat percentiles (usec):
     |  1.00th=[  465],  5.00th=[  498], 10.00th=[  515], 20.00th=[  537],
     | 30.00th=[  553], 40.00th=[  562], 50.00th=[  578], 60.00th=[  603],
     | 70.00th=[  635], 80.00th=[  693], 90.00th=[  750], 95.00th=[  799],
     | 99.00th=[ 1172], 99.50th=[ 1254], 99.90th=[ 1385], 99.95th=[ 1434],
     | 99.99th=[ 1582]
   bw (  MiB/s): min= 2580, max= 3896, per=100.00%, avg=3152.68, stdev=27.22, samples=3495
   iops        : min=10318, max=15587, avg=12608.68, stdev=108.93, samples=3495
  lat (usec)   : 250=0.03%, 500=5.35%, 750=84.50%, 1000=8.68%
  lat (msec)   : 2=1.45%, 4=0.01%
  cpu          : usr=3.68%, sys=6.97%, ctx=2757295, majf=0, minf=132
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2757120,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3146MiB/s (3298MB/s), 3146MiB/s-3146MiB/s (3298MB/s-3298MB/s), io=673GiB (723GB), run=219123-219123msec

Disk stats (read/write):
    dm-0: ios=48/2757087, merge=0/0, ticks=0/1488604, in_queue=1488604, util=100.00%, aggrios=22/2757120, aggrmerge=0/0, aggrticks=1/107736, aggrin_queue=107738, aggrutil=100.00%
  nvme1n2: ios=26/2757120, merge=0/0, ticks=3/103415, in_queue=103417, util=100.00%
  nvme4n2: ios=12/2757120, merge=0/0, ticks=1/113166, in_queue=113168, util=100.00%
  nvme0n2: ios=36/2757120, merge=0/0, ticks=2/103561, in_queue=103563, util=100.00%
  nvme3n2: ios=18/2757120, merge=0/0, ticks=1/110396, in_queue=110398, util=100.00%
  nvme2n2: ios=20/2757120, merge=0/0, ticks=2/108146, in_queue=108148, util=100.00%