fio-test/results/raizn_seq_write/512k-psync-6.out
job1: (g=0): rw=write, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=116356: Thu Sep  5 09:55:21 2024
  write: IOPS=7012, BW=3506MiB/s (3677MB/s)(673GiB/196588msec); 0 zone resets
    clat (usec): min=232, max=5308, avg=1078.07, stdev=263.82
     lat (usec): min=252, max=5379, avg=1125.16, stdev=273.72
    clat percentiles (usec):
     |  1.00th=[  709],  5.00th=[  775], 10.00th=[  824], 20.00th=[  906],
     | 30.00th=[  947], 40.00th=[  996], 50.00th=[ 1045], 60.00th=[ 1090],
     | 70.00th=[ 1123], 80.00th=[ 1188], 90.00th=[ 1336], 95.00th=[ 1516],
     | 99.00th=[ 2245], 99.50th=[ 2343], 99.90th=[ 2507], 99.95th=[ 2540],
     | 99.99th=[ 2704]
   bw (  MiB/s): min= 2324, max= 5309, per=100.00%, avg=3536.48, stdev=64.77, samples=3112
   iops        : min= 4648, max=10618, avg=7071.43, stdev=129.55, samples=3112
  lat (usec)   : 250=0.01%, 500=0.37%, 750=3.00%, 1000=38.32%
  lat (msec)   : 2=56.12%, 4=2.19%, 10=0.01%
  cpu          : usr=5.03%, sys=6.21%, ctx=1378682, majf=0, minf=528
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1378560,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3506MiB/s (3677MB/s), 3506MiB/s-3506MiB/s (3677MB/s-3677MB/s), io=673GiB (723GB), run=196588-196588msec

Disk stats (read/write):
    dm-0: ios=48/1377759, merge=0/0, ticks=4/1322656, in_queue=1322660, util=100.00%, aggrios=22/1378560, aggrmerge=0/0, aggrticks=2/84814, aggrin_queue=84815, aggrutil=100.00%
  nvme1n2: ios=26/1378560, merge=0/0, ticks=3/83178, in_queue=83180, util=100.00%
  nvme4n2: ios=12/1378560, merge=0/0, ticks=1/86462, in_queue=86462, util=100.00%
  nvme0n2: ios=36/1378560, merge=0/0, ticks=2/83249, in_queue=83251, util=100.00%
  nvme3n2: ios=18/1378560, merge=0/0, ticks=2/85741, in_queue=85743, util=100.00%
  nvme2n2: ios=20/1378560, merge=0/0, ticks=2/85441, in_queue=85443, util=100.00%